# 1.
# 구구단 3단을 출력하시오. 단, for, while을 활용하여 다양하게 만들어보시오.

# 1.a
# 40 이하의 3의 배수를 출력하시오(3단의 확장). 반복의 종류는 자유롭게 사용하시오.

# 2.
# 1 ~ 100 중에 7의 배수의 개수를 출력하세요.

# 3.
# lst = [1, 2, 4, 3, 3, 5, 5, 6, 9, 7] 일 때,
# 원소가  1, 4, 5, 7인 경우를 제외하고 출력하세요

# 4.
# 1 ~ 9 까지의 자연수 중 제곱한 수가 10 이상 50 이하인 자연수의 리스트를 출력해보세요.

# 5.
# n = 17일 때, n이 소수인지 판단하시오. (추가로, n을 입력받아 같은 과정을 반복하시오.)
# 소수 : 1, 자기자신으로만 나누어 떨어지는 수

# 6.
# 숫자 두개를 각각 입력받아 두 수 사이에 속한 모든 정수의 합을 구하시오. (ex. 2와 5를 입력받는다면 2 + 3 + 4 + 5 = 14)

# 7
# 2의 배수 혹은 3의 배수를 제외하고 1~30까지 숫자를 출력하시오.
#  1 5 7 11 13 17 19 23 25 29